<!DOCTYPE HTML>
<html>
	<head>
		<title>3.1.1 Conceptos generales del dise&ntilde;o</title>
		<meta charset="utf-8" />
		<meta charset="encoding">
		<meta name="viewport" content="width=device-width, initial-scale=1" />
		<!--[if lte IE 8]><script src="assets/js/ie/html5shiv.js"></script><![endif]-->
		<link rel="stylesheet" href="assets/css/main.css" />
		<!--[if lte IE 8]><link rel="stylesheet" href="assets/css/ie8.css" /><![endif]-->
	</head>
	<body class="left-sidebar">
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header">

					<!-- Inner -->
						<div class="inner">
							<header>
								<h1>3.1.1 Conceptos generales del dise&ntilde;o</h1>
							</header>
						</div>

					<!-- Nav -->
					<nav id="nav">
							<ul>
								<li><a href="index.html">Home</a></li>
								<li>
									<a href="#">Temas</a>
									<ul>
										<li><a href="diseno.html">3. Dise&ntilde;o del software</a></li>
										<li><a href="fundamentos.html">3.1 Fundamentos para el dise&ntilde;o de software</a></li>
										<li><a href="conceptos.html">3.1.1 Conceptos generales del dise&ntilde;o</a></li>
										<li><a href="contexto.html">3.1.2 El contexto del dise&ntilde;o del software</a></li>
									</ul>
								</li>
								<li><a href="audioyVid.html">Audio y Video</a></li>
								<li><a href="resumen.html">Resumen</a></li>
								<li><a href="cuestionario.html">Cuestionario</a></li>
							</ul>
						</nav>

				</div>

			<!-- Main -->
				<div class="wrapper style1">
					<div class="container">
						<div class="row 200%">
							<div class="8u 12u(mobile)" id="content">
								<article id="main">
									<section>
										<header>
											<h3>Dise&ntilde;o detallado.</h3>
										</header>
										<p>
											El dise&ntilde;o arquitect&oacute;nico de un sistema, junto con los requerimientos, deben ser refinados para producir un <strong> dise&ntilde;o detallado </strong>. El proceso de desarrollo utilizado determina el nivel de detalle al cu&aacute;l el dise&ntilde;o se descompone y el nivel de formalidad de su documentaci&oacute;n. Si el dise&ntilde;o se lleva acabo al m&aacute;s m&iacute;nimo nivel de detalle, la tarea de la implementaci&oacute;n se transforma en un simple mapeo del dise&ntilde;o al lenguaje de implementaci&oacute;n deseado; sin embargo es muy frecuente que el dise&ntilde;o no se encuentre especificado al m&aacute;s m&iacute;nimo nivel de detalle, dejando algunas actividades relacionadas con el dise&ntilde;o detallado a que sean realizadas en la etapa de implementaci&oacute;n.
										</p>
									</section>
									<section>
										<header>
											<h3>Ingenier&iacute;a de sistemas.</h3>
										</header>
										<p>
											La ingenier&iacute;a de sistemas es la actividad de especificar dise&ntilde;ar, implementar, validar, utilizar y mantener los sistemas socio-t&eacute;cnicos. Los ingenieros de sistemas no s&oacute;lo tratan con el software, sino tambi&eacute;n con el hardware y las interacciones del sistema con los usuarios y su entorno. Deben pensar en los servicios que el sistema proporciona, las restricciones sobre las que el sistema se debe de construir y funcionar y las formas en las que el sistema es usado para cumplir con su prop&oacute;sito.
											En la siguiente imagen se muestran las fases del proceso de ingenier&iacute;a de sistemas, este modelo tiene una gran influencia sobre el modelo en cascada.
										</p>
										<header>
										<a href="#" class="image featured"><img src="images/3.1.1/1.jpg" alt="" />Fig. 5: Fases del proceso de ingenier&iacute;a de sistemas</a>
										</header>
									</section>
									<section>
										<header>
											<h3>Definici&oacute;n de requerimientos del sistema.</h3>
										</header>
										<p>
											Al definir requerimientos del sistema se especifica que es lo que el sistema debe hacer (sus funciones) y sus propiedades esenciales y deseables. Crear una definici&oacute;n de requerimientos del sistema requiere de consultar con los clientes del sistema y los usuarios finales.
											<br>
											Al definir requerimientos se identifican tres tipos:
											<br>
											1.	Requerimientos funcionales abstractos:
											<br>
											Las funciones b&aacute;sicas que el sistema debe proporcionar se definen en un nivel abstracto. Una especificaci&oacute;n m&aacute;s detallada de requerimientos funcionales tiene lugar en el nivel de subsistemas.
											<br>

											2.	Propiedades del sistema:
											<br>

											Son propiedades emergentes no funcionales del sistema, tales como disponibilidad, rendimiento y seguridad. Estas propiedades no funcionales del sistema afectan los requerimientos de todos los subsistemas.
											<br>


											3.	Caracter&iacute;sticas que no debe mostrar el sistema:
											<br>

											Algunas veces es tan importante especificar lo que el sistema no debe hacer como lo que debe hacer.

										</p>
									</section>
									<section>
										<header>
											<h3>Dise&ntilde;o del sistema.</h3>
										</header>
										<p>
											1.	Dividir requerimientos: Analice los requerimientos y organ&iacute;celos en grupos afines. Normalmente existen varias opciones posibles de divisi&oacute;n, y puede surgir varias alternativas en esta etapa del proceso.
											<br>
											2.	Identificar subsistemas: Debe identificar los diferentes subsistemas que pueden, individual o colectivamente, cumplir los requerimientos. Los grupos de requerimientos est&aacute;n normalmente relacionados con los subsistemas, de tal forma que esta actividad y la divisi&oacute;n de requerimientos se pueden fusionar.
											<br>
											3.	Asignar requerimientos a los subsistemas: Asigne los requerimientos a los subsistemas. En principio, esto debe ser sencillo si la divisi&oacute;n de requerimientos se utiliza para la identificaci&oacute;n de subsistemas.
											<br>
											4.	Especificar la funcionalidad de los subsistemas: Debe enumerar las funciones espec&iacute;ficas asignadas a cada subsistema. Esto puede verse como parte de la fase de dise&ntilde;o del sistema o, si el subsistema es un sistema de software, como parte de la actividad de especificaci&oacute;n de requerimientos para ese sistema.
											<br>
											5.	Definir las interfaces del subsistema: Defina las interfaces necesarias requeridas por cada subsistema.

										</p>
										<header>
										<a href="#" class="image featured"><img src="images/3.1.1/2.jpg" alt="" />Fig. 6: Fases del dise&ntilde;o del sistema</a>
		
										</header>
									</section>
								</article>
							</div>
							</div>
						</div>
					<div class="container">
						<hr />
						<div class="row">
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic07.jpg" alt="" /></a>
							</article>
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic08.jpg" alt="" /></a>
							</article>
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic09.jpg" alt="" /></a>
							</article>
						</div>
					</div>

				</div>
						</div>
						


		<!-- Scripts -->
			<script src="assets/js/jquery.min.js"></script>
			<script src="assets/js/jquery.dropotron.min.js"></script>
			<script src="assets/js/jquery.scrolly.min.js"></script>
			<script src="assets/js/jquery.onvisible.min.js"></script>
			<script src="assets/js/skel.min.js"></script>
			<script src="assets/js/util.js"></script>
			<!--[if lte IE 8]><script src="assets/js/ie/respond.min.js"></script><![endif]-->
			<script src="assets/js/main.js"></script>

	</body>
</html>