<!DOCTYPE HTML>
<html>
	<head>
		<title>3.1.2 El contexto del dise&ntilde;o del software</title>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1" />
		<!--[if lte IE 8]><script src="assets/js/ie/html5shiv.js"></script><![endif]-->
		<link rel="stylesheet" href="assets/css/main.css" />
		<!--[if lte IE 8]><link rel="stylesheet" href="assets/css/ie8.css" /><![endif]-->
	</head>
	<body class="no-sidebar">
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header">

					<!-- Inner -->
						<div class="inner">
							<header>
								<h1><a href="home.html" id="logo">3.1.2 El contexto del dise&ntilde;o del software</a></h1>
							</header>
						</div>

					<!-- Nav -->
						<nav id="nav">
							<ul>
								<li><a href="index.html">Home</a></li>
								<li>
									<a href="#">Temas</a>
									<ul>
										<li><a href="diseno.html">3. Dise&ntilde;o del software</a></li>
										<li><a href="fundamentos.html">3.1 Fundamentos para el dise&ntilde;o de software</a></li>
										<li><a href="conceptos.html">3.1.1 Conceptos generales del dise&ntilde;o</a></li>
										<li><a href="contexto.html">3.1.2 El contexto del dise&ntilde;o del software</a></li>
									</ul>
								</li>
								<li><a href="audioyVid.html">Audio y Video</a></li>
								<li><a href="resumen.html">Resumen</a></li>
								<li><a href="cuestionario.html">Cuestionario</a></li>
							</ul>
						</nav>

				</div>

			<!-- Main -->
				<div class="wrapper style1">
					<div class="container">
						<div class="row 200%">
							<div class="8u 12u(mobile)" id="content">
								<article id="main">
									<section>
										<header>
											<h3>M&eacute;todos de dise&ntilde;o.</h3>
										</header>
										<p>
											En muchos proyectos de desarrollo, el dise&ntilde;o de software es un proceso ad hoc; empezando por un conjunto de requerimientos, usualmente dados en lenguaje natural, se prepara un dise&ntilde;o informal.
											Cuando la programaci&oacute;n en si comienza el dise&ntilde;o se modifica conforme el sistema es implementado, hay poco o ning&uacute;n control formal de los cambios o administraci&oacute;n del dise&ntilde;o. Por ello cuando la etapa de implementaci&oacute;n est&aacute; completa, el dise&ntilde;o ha cambiado tanto con respecto a su especificaci&oacute;n inicial, que el documento original del dise&ntilde;o es una descripci&oacute;n incorrecta o incompleta del sistema.
											Con la introducci&oacute;n de los m&eacute;todos estructurados, una aproximaci&oacute;n m&aacute;s met&oacute;dica al dise&ntilde;o de software se logra, estos m&eacute;todos estructurados son en realidad un conjunto de notaciones y gu&iacute;as para el dise&ntilde;o de software.

										</p>
									</section>
									<section>
										<p>
											Un m&eacute;todo estructurado incluye un modelo de proceso de dise&ntilde;o, notaciones para representar al dise&ntilde;o, formatos de reporte, y gu&iacute;as de reglas y dise&ntilde;o.
											Los m&eacute;todos estructurados pueden soportar algunos o todos los siguientes modelos de un sistema:
											<br>

											1.	Un modelo de flujo de datos donde el sistema es modelado usando las transformaciones de datos que se llevan a cabo conforme son procesados.
											<br>

											2.	Un modelo entidad-relaci&oacute;n que se usa para describir las entidades b&aacute;sicas en el dise&ntilde;o, y las relaciones entre estos. Los modelos entidad relaci&oacute;n son comunes para representar la estructura de una base de datos.
											<br>


											3.	Un modelo estructurado donde los componentes del sistema y sus interacciones se documentan.
											<br>

											4.	M&eacute;todos orientados a objetos que incluyen el modelo de herencia del sistema, as&iacute; como modelos de las relaciones est&aacute;ticas y din&aacute;micas entre los objetos y un modelo de como los objetos interaccionan entre ellos cuando el sistema se est&aacute; ejecutando.


										</p>
									</section>
									
								</article>
							</div>
							</div>
						</div>
					<div class="container">
						<hr />
						<div class="row">
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic07.jpg" alt="" /></a>
							</article>
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic08.jpg" alt="" /></a>
							</article>
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic09.jpg" alt="" /></a>
							</article>
						</div>
					</div>

				</div>
						</div>
						


		<!-- Scripts -->
			<script src="assets/js/jquery.min.js"></script>
			<script src="assets/js/jquery.dropotron.min.js"></script>
			<script src="assets/js/jquery.scrolly.min.js"></script>
			<script src="assets/js/jquery.onvisible.min.js"></script>
			<script src="assets/js/skel.min.js"></script>
			<script src="assets/js/util.js"></script>
			<!--[if lte IE 8]><script src="assets/js/ie/respond.min.js"></script><![endif]-->
			<script src="assets/js/main.js"></script>

	</body>
</html>