<!DOCTYPE HTML>
<html>
	<head>
		<title>3. Dise&ntilde;o del software</title>
		<meta charset="utf-8" />
		<meta charset="encoding">
		<meta name="viewport" content="width=device-width, initial-scale=1" />
		<!--[if lte IE 8]><script src="assets/js/ie/html5shiv.js"></script><![endif]-->
		<link rel="stylesheet" href="assets/css/main.css" />
		<!--[if lte IE 8]><link rel="stylesheet" href="assets/css/ie8.css" /><![endif]-->
	</head>
	<body class="left-sidebar">
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header">

					<!-- Inner -->
						<div class="inner">
							<header>
								<h1>3. Dise&ntilde;o del software</h1>
							</header>
						</div>

						<nav id="nav">
							<ul>
								<li><a href="index.html">Home</a></li>
								<li>
									<a href="#">Temas</a>
									<ul>
										<li><a href="diseno.html">3. Dise&ntilde;o del software</a></li>
										<li><a href="fundamentos.html">3.1 Fundamentos para el dise&ntilde;o de software</a></li>
										<li><a href="conceptos.html">3.1.1 Conceptos generales del dise&ntilde;o</a></li>
										<li><a href="contexto.html">3.1.2 El contexto del dise&ntilde;o del software</a></li>
									</ul>
								</li>
								<li><a href="audioyVid.html">Audio y Video</a></li>
								<li><a href="resumen.html">Resumen</a></li>
								<li><a href="cuestionario.html">Cuestionario</a></li>
							</ul>
						</nav>

				</div>

			<!-- Main -->
				<div class="wrapper style1">
					<div class="container">
						<div class="row 200%">
							<div class="8u 12u(mobile)" id="content">
								<article id="main">
									<header>
										<a href="#" class="image featured"><img src="images/3/1.JPG" alt="" /><h4>Fig. 2: Proceso de desarrollo de software en espiral, un modelo de desarrollo de software t&iacute;pico cuya segunda etapa es el dise&ntilde;o arquitect&oacute;nico</h4></a>
									</header>
									<section>
										<header>
											<h3>Introducci&oacute;n al dise&ntilde;o</h3>
										</header>
										<p>
											Una vez que los requerimientos de un proyecto se tienen claros, la transformaci&oacute;n de los requerimientos
											en un dise&ntilde;o comienza. Este es un paso dif&iacute;cil que requiere la transformaci&oacute;n de un conjunto de abstracciones (los requerimientos) en otro conjunto de abtracciones (el dise&ntilde;o).
											El dise&ntilde;o de software tiene que ver con c&oacute;mo se estructurar&aacute; el software, eso es,
											que son sus componentes y c&oacute;mo estos se relacionan los unos con los otros.
											Para sistemas grandes suele hacer sentido dividir las fases del dise&ntilde;o en dos partes:

										</p>
										<p>
											<strong>Dise&ntilde;o arquitect&oacute;nico:</strong> Es una visi&oacute;n de alto nivel del sistema. Los componentes principales de este se enlistan, con propiedades externas a los componentes y las relaciones entre estos componentes. Los requerimientos no funcionales dan pauta para gran parte de la arquitectura.
											<br>
											<strong>Dise&ntilde;o detallado:</strong> Los componentes son desmenuzados a un nivel mucho m&aacute;s alto de detalle. La arquitectura y los requerimientos funcionales son el motor de esta fase. La arquitectura nos sirve como gu&iacute;a y todos los requerimientos funcionales deben ser atendidos por al menos un m&oacute;dulo dentro del dise&ntilde;o detallado.
										</p>
									</section>
									<section>
										<header>
											<h3>Las actividades espec&iacute;ficas dentro del proceso de dise&ntilde;o son:</h3>
										</header>
										<p>
											1.	Dise&ntilde;o de arquitectura: Los subsistemas que conforman el sistema y sus relaciones son identificadas y documentadas.
											<br>
											2.	Especificaci&oacute;n abstracta: Para cada subsistema, una especificaci&oacute;n abstracta de los servicios y limitaciones bajo la cual deben operar es producida.
											<br>
											3.	Dise&ntilde;o de interfaces: Para cada subsistema, su interface con otros subsistemas es dise&ntilde;ada y documentada. La especificaci&oacute;n de la interface debe ser no ambigua ya que permite que el subsistema sea usado sin conocimiento previo de su operaci&oacute;n.
											<br>
											4.	Dise&ntilde;o de componentes: Los servicios son alojados en diferentes componentes y la interface de estos componentes es dise&ntilde;ada
											<br>
											5.	Dise&ntilde;o de estructuras de datos: Las estructuras de datos usadas en la implementaci&oacute;n del sistema son dise&ntilde;adas en detalle y especificadas.
											<br>
											6.	Dise&ntilde;o de algoritmos:  Los algoritmos usados para proveer servicios son dise&ntilde;ados en detalle y especificados.
										</p>
									</section>
									<section>
										<header>
											<h3>Dise&ntilde;o e implementaci&oacute;n</h3>
										</header>
										<p>
											La etapa de implementaci&oacute;n en el desarrollo de software es el proceso de convertir una especificaci&oacute;n de un sistema en un ejecutable.
											Siempre requiere de procesos de dise&ntilde;o de software y programaci&oacute;n, pero si se aplica
											una aproximaci&oacute;n evolutiva al desarrollo tambi&eacute;n puede incluir refinamiento de las especificaciones del software.
											Un dise&ntilde;o de software es una descripci&oacute;n de la estructura del software a ser implementado, los datos que forman parte del sistema, las interfaces de los componentes del sistema y, algunas veces, los algoritmos usados.
											Los dise&ntilde;adores no llegan inmediatamente a un dise&ntilde;o terminado sino que este es desarrollado iterativamente a trav&eacute;s de un n&uacute;mero de versiones.
											El proceso de dise&ntilde;o requiere agregar formalidad y detalle conforme el dise&ntilde;o es desarrollado, con un constante objetivo de corregir dise&ntilde;os anteriores.
											El proceso de dise&ntilde;o tambi&eacute;n puede incluir y desarrollar diversos modelos del sistema en niveles diferentes de abstracci&oacute;n. Conforme se descompone un dise&ntilde;o, errores y omisiones en etapas anteriores se develan.
											La retroalimentaci&oacute;n de una etapa a la otra y el consiguiente trabajo repetido del dise&ntilde;o ambos son inevitables en cualquier proceso de dise&ntilde;o.

										</p>
									</section>
								</article>
							</div>
							</div>
						</div>
					<div class="container">
						<hr />
						<div class="row">
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic07.jpg" alt="" /></a>
							</article>
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic08.jpg" alt="" /></a>
							</article>
							<article class="4u 12u(mobile) special">
								<a href="#" class="image featured"><img src="images/pic09.jpg" alt="" /></a>
							</article>
						</div>
					</div>

				</div>
						</div>



		<!-- Scripts -->
			<script src="assets/js/jquery.min.js"></script>
			<script src="assets/js/jquery.dropotron.min.js"></script>
			<script src="assets/js/jquery.scrolly.min.js"></script>
			<script src="assets/js/jquery.onvisible.min.js"></script>
			<script src="assets/js/skel.min.js"></script>
			<script src="assets/js/util.js"></script>
			<!--[if lte IE 8]><script src="assets/js/ie/respond.min.js"></script><![endif]-->
			<script src="assets/js/main.js"></script>

	</body>
</html>
